In [1]:
import pandas as pd

In [2]:
from pandas import Series, DataFrame

# Series

In [3]:
sample_pandas_data = pd.Series([0,10,20,30,40,50,60,70,80,90])
print(sample_pandas_data)

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [5]:
#印出資料值
print('資料值:',sample_pandas_data.values)
#印出索引值
print('資料值:',sample_pandas_data.index)

資料值: [ 0 10 20 30 40 50 60 70 80 90]
資料值: RangeIndex(start=0, stop=10, step=1)

# Specify index in Series

In [6]:
sample_pandas_index_data = pd.Series(
    [0, 10,20,30,40,50,60,70,80,90],
    #輸入自訂的文字index
    ['a','b','c','d','e','f','g','h','i','j']
    
)

print(sample_pandas_index_data)

a     0
b    10
c    20
d    30
e    40
f    50
g    60
h    70
i    80
j    90
dtype: int64

In [9]:
print('資料值:', sample_pandas_index_data.values)
print('索引值:', sample_pandas_index_data.index)
print(sample_pandas_index_data.index[3])

資料值: [ 0 10 20 30 40 50 60 70 80 90]
索引值: Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')
d

# DataFrame

In [10]:
attri_data1 = {'ID':['100','101','102','103','104'],
               'City':['Taipei','Taipei','Hsinchu','Tainan','Kaohsiung'],
               'Birth_year':[1990,1989,1992,1997,1982],
               'Name':['Sally','Hanks','Hannah','Kitty','Steve']}

attri_data_frame1 = DataFrame(attri_data1)

print(attri_data_frame1)

    ID       City  Birth_year    Name
0  100     Taipei        1990   Sally
1  101     Taipei        1989   Hanks
2  102    Hsinchu        1992  Hannah
3  103     Tainan        1997   Kitty
4  104  Kaohsiung        1982   Steve

# Specify Index in DataFrame

In [11]:
attri_data_frame_index1 = DataFrame(attri_data1,
                                    #輸入自訂的index
                                    index=['a','b','c','d','e']
                                   )
print(attri_data_frame_index1)

    ID       City  Birth_year    Name
a  100     Taipei        1990   Sally
b  101     Taipei        1989   Hanks
c  102    Hsinchu        1992  Hannah
d  103     Tainan        1997   Kitty
e  104  Kaohsiung        1982   Steve

In [12]:
attri_data_frame_index1

    ID       City  Birth_year    Name
a  100     Taipei        1990   Sally
b  101     Taipei        1989   Hanks
c  102    Hsinchu        1992  Hannah
d  103     Tainan        1997   Kitty
e  104  Kaohsiung        1982   Steve

# Transpose

In [14]:
#attri_data_frame1的行列交換
attri_data_frame1.T

                 0       1        2       3          4
ID             100     101      102     103        104
City        Taipei  Taipei  Hsinchu  Tainan  Kaohsiung
Birth_year    1990    1989     1992    1997       1982
Name         Sally   Hanks   Hannah   Kitty      Steve

# Get One Column

In [25]:
#取得Birth_year行
#attri_data_frame1.Birth_year

0    1990
1    1989
2    1992
3    1997
4    1982
Name: Birth_year, dtype: int64

# Get Many Column

In [19]:
#取得ID與Birth_year行
attri_data_frame1[['ID','Birth_year']]

    ID  Birth_year
0  100        1990
1  101        1989
2  102        1992
3  103        1997
4  104        1982

# Filter

In [26]:
# attri_data_frame1中找出City為Taipei的資料
attri_data_frame1[attri_data_frame1['City'] == 'Taipei']

    ID    City  Birth_year   Name
0  100  Taipei        1990  Sally
1  101  Taipei        1989  Hanks

In [27]:
attri_data_frame1['City'] == 'Taipei'

0     True
1     True
2    False
3    False
4    False
Name: City, dtype: bool

# Filter for Many Requiements

In [29]:
#attri_data_frame1中找出City為台北和台南的資料
attri_data_frame1[attri_data_frame1['City'].isin(['Taipei','Tainan'])]

    ID    City  Birth_year   Name
0  100  Taipei        1990  Sally
1  101  Taipei        1989  Hanks
3  103  Tainan        1997  Kitty

# Pratice

In [31]:
#找出attri_data_frame1的Birth_year小於1990
attri_data_frame1[attri_data_frame1['Birth_year'] <= 1990]

    ID       City  Birth_year   Name
0  100     Taipei        1990  Sally
1  101     Taipei        1989  Hanks
4  104  Kaohsiung        1982  Steve

# Drop Column

In [36]:
#去掉Birth_year這一行
print(attri_data_frame1.drop([0],axis = 0))
print(attri_data_frame1.drop(['Birth_year'],axis = 1))

    ID       City  Birth_year    Name
1  101     Taipei        1989   Hanks
2  102    Hsinchu        1992  Hannah
3  103     Tainan        1997   Kitty
4  104  Kaohsiung        1982   Steve
    ID       City    Name
0  100     Taipei   Sally
1  101     Taipei   Hanks
2  102    Hsinchu  Hannah
3  103     Tainan   Kitty
4  104  Kaohsiung   Steve

In [38]:
attri_data1 = {'ID':['100','101','102','103','104'],
               'City':['Taipei','Taipei','Hsinchu','Tainan','Kaohsiung'],
               'Birth_year':[1990,1989,1992,1997,1982],
               'Name':['Sally','Hanks','Hannah','Kitty','Steve']}


attri_data_frame1 = DataFrame(attri_data1)
print(attri_data_frame1)

attri_data_frame1.drop(['Birth_year'], axis = 1)
print(attri_data_frame1)

#使用assign，使得attri_data_frame1的資料中真正拿掉Birth_year行
attri_data_frame1 = attri_data_frame1.drop(['Birth_year'], axis = 1)
print(attri_data_frame1)

    ID       City  Birth_year    Name
0  100     Taipei        1990   Sally
1  101     Taipei        1989   Hanks
2  102    Hsinchu        1992  Hannah
3  103     Tainan        1997   Kitty
4  104  Kaohsiung        1982   Steve
    ID       City  Birth_year    Name
0  100     Taipei        1990   Sally
1  101     Taipei        1989   Hanks
2  102    Hsinchu        1992  Hannah
3  103     Tainan        1997   Kitty
4  104  Kaohsiung        1982   Steve
    ID       City    Name
0  100     Taipei   Sally
1  101     Taipei   Hanks
2  102    Hsinchu  Hannah
3  103     Tainan   Kitty
4  104  Kaohsiung   Steve

# Combine DataFrame

In [39]:
#準備資料
attri_data1 = {'ID':['100','101','102','103','104'],
               'City':['Taipei','Taipei','Hsinchu','Tainan','Kaohsiung'],
               'Birth_year':[1990,1989,1992,1997,1982],
               'Name':['Sally','Hanks','Hannah','Kitty','Steve']}
attri_data_frame1 = DataFrame(attri_data1)
print(attri_data_frame1)


attri_data2 = {'ID':['100','101','102','105','107'],
               'Math':[50,43,33,76,98],
               'English':[90,30,20,50,30],
               'Sex':['M','F','F','M','M']}
attri_data_frame2 = DataFrame(attri_data2)
print(attri_data_frame2)

    ID       City  Birth_year    Name
0  100     Taipei        1990   Sally
1  101     Taipei        1989   Hanks
2  102    Hsinchu        1992  Hannah
3  103     Tainan        1997   Kitty
4  104  Kaohsiung        1982   Steve
    ID  Math  English Sex
0  100    50       90   M
1  101    43       30   F
2  102    33       20   F
3  105    76       50   M
4  107    98       30   M

In [41]:
#合併資料
pd.merge(attri_data_frame1,attri_data_frame2)

    ID     City  Birth_year    Name  Math  English Sex
0  100   Taipei        1990   Sally    50       90   M
1  101   Taipei        1989   Hanks    43       30   F
2  102  Hsinchu        1992  Hannah    33       20   F

# Statistics

In [42]:
#將「Sex」的行設為基準來計算出數學成績的平均分數
attri_data_frame2.groupby('Sex')['Math'].mean()

Sex
F    38.000000
M    74.666667
Name: Math, dtype: float64

# Practice

In [45]:
#將「Sex」的行設為基準來計算出英文成績的最大值與最小值。
print(attri_data_frame2.groupby('Sex')['English'].max())
print(attri_data_frame2.groupby('Sex')['English'].min())

Sex
F    30
M    90
Name: English, dtype: int64
Sex
F    20
M    30
Name: English, dtype: int64

# Sort

In [46]:
#準備資料
attri_data2 = {'ID':['100','101','102','103','104'],
               'City':['Taipei','Taipei','Hsinchu','Tainan','Kaohsiung'],
               'Birth_year':[1990,1989,1992,1997,1982],
               'Name':['Sally','Hanks','Hannah','Kitty','Steve']}
attri_data_frame_index2 = DataFrame(attri_data2,index=['e','b','a','d','c'])
attri_data_frame_index2

    ID       City  Birth_year    Name
e  100     Taipei        1990   Sally
b  101     Taipei        1989   Hanks
a  102    Hsinchu        1992  Hannah
d  103     Tainan        1997   Kitty
c  104  Kaohsiung        1982   Steve

In [47]:
#sort by index
attri_data_frame_index2.sort_index()

    ID       City  Birth_year    Name
a  102    Hsinchu        1992  Hannah
b  101     Taipei        1989   Hanks
c  104  Kaohsiung        1982   Steve
d  103     Tainan        1997   Kitty
e  100     Taipei        1990   Sally

In [48]:
#sort by values
attri_data_frame_index2.Birth_year.sort_values()

c    1982
b    1989
e    1990
a    1992
d    1997
Name: Birth_year, dtype: int64

# Check nan

In [49]:
#確認是否存在該值
attri_data_frame_index2.isin(['Taipei'])

      ID   City  Birth_year   Name
e  False   True       False  False
b  False   True       False  False
a  False  False       False  False
d  False  False       False  False
c  False  False       False  False

In [51]:
# 處理遺漏值
# 將Name設成nan
import numpy as np
attri_data_frame_index2['Name'] = np.nan

#判斷是否為nan
attri_data_frame_index2.isnull()

      ID   City  Birth_year  Name
e  False  False       False  True
b  False  False       False  True
a  False  False       False  True
d  False  False       False  True
c  False  False       False  True

In [52]:
#計算nan的總數
attri_data_frame_index2.isnull().sum()

ID            0
City          0
Birth_year    0
Name          5
dtype: int64

# 練習

In [122]:
np.random.seed(2)
array2 = np.random.randint(2,size = 100)
array = []
for i in range(0,100):
    if array2[i] == 0:
        array.append('F');
    else:
        array.append('M');
np.random.seed(3)
array3 = np.random.normal(1000,10,size = 100)
attri_data = { 'ID':range(1,101),
    'Sex':array,
               'Money':array3
               }
attri_data_frame_index2 = DataFrame(attri_data)
attri_data_frame_index2

print(attri_data_frame_index2[attri_data_frame_index2['Money'] == attri_data_frame_index2['Money'].min()])
print(attri_data_frame_index2[attri_data_frame_index2['Money'] > 1010])

print(attri_data_frame_index2[attri_data_frame_index2['Money'] > 1010].sort_values('Money',ascending = False))

    ID Sex       Money
88  89   F  970.842622
     ID Sex        Money
0     1   F  1017.886285
13   14   M  1017.095731
22   23   M  1014.861484
31   32   F  1019.761108
38   39   M  1011.239780
50   51   F  1010.131834
52   53   F  1011.081875
53   54   F  1011.193907
54   55   F  1014.875431
60   61   F  1010.481475
61   62   F  1013.337378
63   64   M  1017.746450
69   70   M  1019.389785
73   74   F  1017.696273
79   80   F  1013.916629
85   86   F  1011.678823
99  100   F  1021.581493
     ID Sex        Money
99  100   F  1021.581493
31   32   F  1019.761108
69   70   M  1019.389785
0     1   F  1017.886285
63   64   M  1017.746450
73   74   F  1017.696273
13   14   M  1017.095731
54   55   F  1014.875431
22   23   M  1014.861484
79   80   F  1013.916629
61   62   F  1013.337378
85   86   F  1011.678823
38   39   M  1011.239780
53   54   F  1011.193907
52   53   F  1011.081875
60   61   F  1010.481475
50   51   F  1010.131834

# 資料補值：遺漏資料的處理

In [93]:
#資料的準備
import numpy as np
from numpy import nan as NA
import pandas as pd
np.random.seed(0)
df = pd.DataFrame(np.random.rand(10, 4))
# 設定為NA
df.iloc[1,0] = NA
df.iloc[2:3,2] = NA
df.iloc[5:,3] = NA
print(df)

          0         1         2         3
0  0.548814  0.715189  0.602763  0.544883
1       NaN  0.645894  0.437587  0.891773
2  0.963663  0.383442       NaN  0.528895
3  0.568045  0.925597  0.071036  0.087129
4  0.020218  0.832620  0.778157  0.870012
5  0.978618  0.799159  0.461479       NaN
6  0.118274  0.639921  0.143353       NaN
7  0.521848  0.414662  0.264556       NaN
8  0.456150  0.568434  0.018790       NaN
9  0.612096  0.616934  0.943748       NaN

In [94]:
#成批刪除(list-wise deletion)
df.dropna()

          0         1         2         3
0  0.548814  0.715189  0.602763  0.544883
3  0.568045  0.925597  0.071036  0.087129
4  0.020218  0.832620  0.778157  0.870012

In [95]:
#逐對刪除  拿想要的 再刪除
df[[0,1]].dropna()

          0         1
0  0.548814  0.715189
2  0.963663  0.383442
3  0.568045  0.925597
4  0.020218  0.832620
5  0.978618  0.799159
6  0.118274  0.639921
7  0.521848  0.414662
8  0.456150  0.568434
9  0.612096  0.616934

In [100]:
#填補
print(df.fillna(0))
#拿前一個值
print(df.fillna(method = 'ffill'))
#平均值來填補
print(df.fillna(df.mean()))

          0         1         2         3
0  0.548814  0.715189  0.602763  0.544883
1  0.000000  0.645894  0.437587  0.891773
2  0.963663  0.383442  0.000000  0.528895
3  0.568045  0.925597  0.071036  0.087129
4  0.020218  0.832620  0.778157  0.870012
5  0.978618  0.799159  0.461479  0.000000
6  0.118274  0.639921  0.143353  0.000000
7  0.521848  0.414662  0.264556  0.000000
8  0.456150  0.568434  0.018790  0.000000
9  0.612096  0.616934  0.943748  0.000000
          0         1         2         3
0  0.548814  0.715189  0.602763  0.544883
1  0.548814  0.645894  0.437587  0.891773
2  0.963663  0.383442  0.437587  0.528895
3  0.568045  0.925597  0.071036  0.087129
4  0.020218  0.832620  0.778157  0.870012
5  0.978618  0.799159  0.461479  0.870012
6  0.118274  0.639921  0.143353  0.870012
7  0.521848  0.414662  0.264556  0.870012
8  0.456150  0.568434  0.018790  0.870012
9  0.612096  0.616934  0.943748  0.870012
          0         1         2         3
0  0.548814  0.715189  0.602763  0.544883
1  0.531970  0.645894  0.437587  0.891773
2  0.963663  0.383442  0.413497  0.528895
3  0.568045  0.925597  0.071036  0.087129
4  0.020218  0.832620  0.778157  0.870012
5  0.978618  0.799159  0.461479  0.584539
6  0.118274  0.639921  0.143353  0.584539
7  0.521848  0.414662  0.264556  0.584539
8  0.456150  0.568434  0.018790  0.584539
9  0.612096  0.616934  0.943748  0.584539

練習

In [108]:
import numpy as np
from numpy import nan as NA
import pandas as pd
import numpy.random as random
random.seed(0)
df2 = pd.DataFrame(np.random.rand(15, 6))
df2.iloc[2,0] = NA
df2.iloc[5:8,2] = NA
df2.iloc[7:9,3] = NA
df2.iloc[10,5] = NA
df2

           0         1         2         3         4         5
0   0.548814  0.715189  0.602763  0.544883  0.423655  0.645894
1   0.437587  0.891773  0.963663  0.383442  0.791725  0.528895
2        NaN  0.925597  0.071036  0.087129  0.020218  0.832620
3   0.778157  0.870012  0.978618  0.799159  0.461479  0.780529
4   0.118274  0.639921  0.143353  0.944669  0.521848  0.414662
5   0.264556  0.774234       NaN  0.568434  0.018790  0.617635
6   0.612096  0.616934       NaN  0.681820  0.359508  0.437032
7   0.697631  0.060225       NaN       NaN  0.210383  0.128926
8   0.315428  0.363711  0.570197       NaN  0.988374  0.102045
9   0.208877  0.161310  0.653108  0.253292  0.466311  0.244426
10  0.158970  0.110375  0.656330  0.138183  0.196582       NaN
11  0.820993  0.097101  0.837945  0.096098  0.976459  0.468651
12  0.976761  0.604846  0.739264  0.039188  0.282807  0.120197
13  0.296140  0.118728  0.317983  0.414263  0.064147  0.692472
14  0.566601  0.265389  0.523248  0.093941  0.575946  0.929296

In [110]:
df2.dropna()

           0         1         2         3         4         5
0   0.548814  0.715189  0.602763  0.544883  0.423655  0.645894
1   0.437587  0.891773  0.963663  0.383442  0.791725  0.528895
3   0.778157  0.870012  0.978618  0.799159  0.461479  0.780529
4   0.118274  0.639921  0.143353  0.944669  0.521848  0.414662
9   0.208877  0.161310  0.653108  0.253292  0.466311  0.244426
11  0.820993  0.097101  0.837945  0.096098  0.976459  0.468651
12  0.976761  0.604846  0.739264  0.039188  0.282807  0.120197
13  0.296140  0.118728  0.317983  0.414263  0.064147  0.692472
14  0.566601  0.265389  0.523248  0.093941  0.575946  0.929296

In [113]:
print(df2.fillna(0))
print(df2.fillna(df2.mean()))

           0         1         2         3         4         5
0   0.548814  0.715189  0.602763  0.544883  0.423655  0.645894
1   0.437587  0.891773  0.963663  0.383442  0.791725  0.528895
2   0.000000  0.925597  0.071036  0.087129  0.020218  0.832620
3   0.778157  0.870012  0.978618  0.799159  0.461479  0.780529
4   0.118274  0.639921  0.143353  0.944669  0.521848  0.414662
5   0.264556  0.774234  0.000000  0.568434  0.018790  0.617635
6   0.612096  0.616934  0.000000  0.681820  0.359508  0.437032
7   0.697631  0.060225  0.000000  0.000000  0.210383  0.128926
8   0.315428  0.363711  0.570197  0.000000  0.988374  0.102045
9   0.208877  0.161310  0.653108  0.253292  0.466311  0.244426
10  0.158970  0.110375  0.656330  0.138183  0.196582  0.000000
11  0.820993  0.097101  0.837945  0.096098  0.976459  0.468651
12  0.976761  0.604846  0.739264  0.039188  0.282807  0.120197
13  0.296140  0.118728  0.317983  0.414263  0.064147  0.692472
14  0.566601  0.265389  0.523248  0.093941  0.575946  0.929296
           0         1         2         3         4         5
0   0.548814  0.715189  0.602763  0.544883  0.423655  0.645894
1   0.437587  0.891773  0.963663  0.383442  0.791725  0.528895
2   0.485778  0.925597  0.071036  0.087129  0.020218  0.832620
3   0.778157  0.870012  0.978618  0.799159  0.461479  0.780529
4   0.118274  0.639921  0.143353  0.944669  0.521848  0.414662
5   0.264556  0.774234  0.588126  0.568434  0.018790  0.617635
6   0.612096  0.616934  0.588126  0.681820  0.359508  0.437032
7   0.697631  0.060225  0.588126  0.388038  0.210383  0.128926
8   0.315428  0.363711  0.570197  0.388038  0.988374  0.102045
9   0.208877  0.161310  0.653108  0.253292  0.466311  0.244426
10  0.158970  0.110375  0.656330  0.138183  0.196582  0.495949
11  0.820993  0.097101  0.837945  0.096098  0.976459  0.468651
12  0.976761  0.604846  0.739264  0.039188  0.282807  0.120197
13  0.296140  0.118728  0.317983  0.414263  0.064147  0.692472
14  0.566601  0.265389  0.523248  0.093941  0.575946  0.929296

# 資料標註

In [114]:
#用labal box 標註